# Day 3: The Story of Titanic

## Questions about the Titanic

1. Koľkí pasažieri prežili?
2. Koľko mužov a koľko žien cestovalo/prežilo?
3. Najstarší/najmlaší pasažier? Najstaršia žena/muž?
4. Koľko pasažierov bolo s menom Jack?
5. Koľko pasažierov s menom Rose?
6. Čo všetko malo vplyv na to, že pasažier prežil? (vek, pohlavie, vrstva, paluba, ...)
7. Koľko bola priemerná cena pre príslušnú triedu pasažierov?

## Links

* [Pandas tahak](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

## Merge

In [1]:
import pandas as pd

employee = pd.read_csv('data/examples/employee.csv')
department = pd.read_csv('data/examples/department.csv')

### Inner Join

```sql
SELECT *
FROM employee e
INNER JOIN department d
    ON e.DepartmentId = d.DepartmentId
```

In [8]:
employee.merge(department)
pd.merge(employee, department)

    LastName  DepartmentId DepartmentName
0   Rafferty          31.0          Sales
1      Jones          33.0    Engineering
2  Steinberg          33.0    Engineering
3   Robinson          34.0       Clerical
4      Smith          34.0       Clerical

### Left Outer Join

* výsledok vždy obsahuje všetky záznamy ľavej tabuľky
* každý riadok z ľavej tabuľky sa vo výsledku nachádza aspoň raz
* chýbajúce záznamy pravej tabuľky sú nahradené hodnotou`NULL`

```sql
SELECT *
FROM employee e
LEFT OUTER JOIN department d
    ON e.DepartmentId = d.DepartmentId
```

Zalezi na poradi (ktora tabulka je lava). Ak je to `employee`, tak vysledok bude vyzerat takto:

In [13]:
employee.merge(department, how='left', on='DepartmentId')

   DepartmentId DepartmentName   LastName
0            31          Sales   Rafferty
1            33    Engineering      Jones
2            33    Engineering  Steinberg
3            34       Clerical   Robinson
4            34       Clerical      Smith
5            35      Marketing        NaN

V pripade, ze lava tabulka bude department, tak to bude vyzerat takto:

In [14]:
department.merge(employee, how='left', on='DepartmentId')

   DepartmentId DepartmentName   LastName
0            31          Sales   Rafferty
1            33    Engineering      Jones
2            33    Engineering  Steinberg
3            34       Clerical   Robinson
4            34       Clerical      Smith
5            35      Marketing        NaN

### Right Outer Join

* výsledok vždy obsahuje všetky záznamy pravej tabuľky
* každý riadok z pravej tabuľky sa vo výsledku nachádza aspoň raz
* chýbajúce záznamy ľavej tabuľky sú nahradené hodnotou `NULL`

```sql
SELECT *
FROM employee e
LEFT OUTER JOIN department d
    ON e.DepartmentId = d.DepartmentId
```

Zalezi na poradi (ktora tabulka je lava). Ak je to `employee`, tak vysledok bude vyzerat takto:

In [16]:
employee.merge(department, how='right', on='DepartmentId')

    LastName  DepartmentId DepartmentName
0   Rafferty          31.0          Sales
1      Jones          33.0    Engineering
2  Steinberg          33.0    Engineering
3   Robinson          34.0       Clerical
4      Smith          34.0       Clerical
5        NaN          35.0      Marketing

Ak je prva tabulka `department`, tak vysledok bude vyzerat takto:

In [18]:
department.merge(employee, how='right', on='DepartmentId')

   DepartmentId DepartmentName   LastName
0          31.0          Sales   Rafferty
1          33.0    Engineering      Jones
2          33.0    Engineering  Steinberg
3          34.0       Clerical   Robinson
4          34.0       Clerical      Smith
5           NaN            NaN       John

### Full Outer Join

* výsledok je zjednotením ľavého a pravého vonkajšieho spojenia

```sql
SELECT * 
FROM employee e
RIGHT OUTER JOIN department d
  ON e.DepartmentID = d.DepartmentID;
```

In [19]:
department.merge(employee, how='outer', on='DepartmentId')

   DepartmentId DepartmentName   LastName
0          31.0          Sales   Rafferty
1          33.0    Engineering      Jones
2          33.0    Engineering  Steinberg
3          34.0       Clerical   Robinson
4          34.0       Clerical      Smith
5          35.0      Marketing        NaN
6           NaN            NaN       John

In [20]:
employee.merge(department, how='outer', on='DepartmentId')

    LastName  DepartmentId DepartmentName
0   Rafferty          31.0          Sales
1      Jones          33.0    Engineering
2  Steinberg          33.0    Engineering
3   Robinson          34.0       Clerical
4      Smith          34.0       Clerical
5       John           NaN            NaN
6        NaN          35.0      Marketing